<!--
 * @Author: 谭洁莹
 * @Date: 2026-04-15 15:30:27
 * @LastEditTime: 2026-04-15 16:33:39
 * @FilePath: /pages/cataract/extended-depth-of-focus-lenses.vue
 * @Description: 扩展景深人工晶体
-->
<script lang="ts" setup>
definePageMeta({
  layout: 'page',
})
</script>
<template>
  <div>
    <section class="banner flex items-center lg:justify-center mb-4 lg:mb-9">
      <h1
        class="pl-2 pt-1/5 lg:p-0 lg:text-center text-primary text-3xl lg:text-5xl font-medium tracking-widest !leading-normal"
      >
        白內障<br />人工晶體種類
      </h1>
    </section>
    <section
      class="wrapper flex justify-center items-center flex-col lg:flex-row lg:gap-5"
    >
      <svg
        class="w-[64px] h-[64px] lg:w-25 lg:h-25"
        xmlns="http://www.w3.org/2000/svg"
        viewBox="0 0 101 92"
        fill="none"
      >
        <g clip-path="url(#a)">
          <path
            d="M87.18 19.362A46.45 46.45 0 0 0 71.232 5.344 45.9 45.9 0 0 0 49.737 0C37.457 0 25.913 4.784 17.23 13.473 8.546 22.16 3.765 33.713 3.765 46c0 4.862.755 9.648 2.241 14.23l.436 1.142 2.96-1.136-.392-1.025a42.8 42.8 0 0 1-2.075-13.209c0-11.44 4.453-22.195 12.536-30.283C27.555 7.63 38.304 3.174 49.737 3.174a42.74 42.74 0 0 1 20.006 4.973A43.26 43.26 0 0 1 84.716 21.37l.124.177.169.136c8.267 6.754 12.82 15.39 12.82 24.317s-4.553 17.563-12.82 24.317l-.169.136-.124.177a43.3 43.3 0 0 1-14.973 13.223 42.74 42.74 0 0 1-20.006 4.973c-9.385 0-18.294-2.982-25.762-8.623-.466-.351-1.185-.968-1.958-1.642a29 29 0 0 1 3.341-.373c.965-.053 1.938.224 2.822.805a39.43 39.43 0 0 0 21.692 6.47 39.5 39.5 0 0 0 20.02-5.437 39.9 39.9 0 0 0 14.207-14.264l2.031-4.076c3.169-2.519 5.291-8.516 5.291-15.878s-2.017-13.053-5.053-15.678l-2.237-4.213-.03-.056a39.77 39.77 0 0 0-15.799-15.158c-6.834-3.609-14.568-5.116-22.37-4.362-18.29 1.77-33.17 16.28-35.386 34.502-.674 5.548-.226 11.024 1.335 16.276.288.968.262 1.938-.077 2.806a28.4 28.4 0 0 1-9.882 12.763l-1.92 1.384 1.853 2.573 1.92-1.383a31.57 31.57 0 0 0 10.984-14.185c.596-1.533.653-3.214.162-4.864-1.436-4.832-1.849-9.876-1.226-14.988C15.732 24.47 29.42 11.127 46.24 9.5c7.18-.696 14.3.692 20.584 4.01a36.5 36.5 0 0 1 6.19 4.128c1.954 3.95 2.88 12.043 2.955 17.033-1.248 2.957-1.982 6.81-1.982 11.136s.736 8.185 1.984 11.14c-.06 4.882-.95 12.873-2.842 16.938a36.5 36.5 0 0 1-4.84 3.406 36.35 36.35 0 0 1-18.413 4.998 36.3 36.3 0 0 1-19.954-5.95c-1.455-.953-3.092-1.411-4.736-1.318a33 33 0 0 0-6.167.93l-.07-.06-.083.097C13.558 77.34 9.91 79.69 8.325 80.865l-2.497 1.897 1.92 2.524 2.364-1.8.099-.073c1.27-.942 4.022-2.727 8.017-3.958q.412.358.823.72c1.173 1.029 2.28 2.002 3.014 2.556 8.023 6.059 17.592 9.263 27.672 9.263 7.488 0 14.92-1.848 21.494-5.344a46.5 46.5 0 0 0 15.95-14.018C96.094 65.284 101 55.832 101 45.994s-4.906-19.29-13.82-26.638zm-9.343 49.82c.528-2.565.878-5.317 1.082-7.798.932.839 1.964 1.366 3.064 1.529l-.646 1.299a36.5 36.5 0 0 1-3.5 4.97M88.254 45.81c0 8.006-2.93 13.988-5.549 13.988-1.212 0-2.56-1.36-3.602-3.636-1.255-2.739-1.946-6.415-1.946-10.352 0-8.007 2.929-13.989 5.548-13.989 1.213 0 2.56 1.36 3.603 3.637 1.254 2.738 1.946 6.414 1.946 10.352m-6.906-18.373.672 1.265c-1.118.157-2.166.688-3.111 1.543-.21-2.506-.571-5.278-1.11-7.852a37 37 0 0 1 3.547 5.042z"
            fill="url(#b)"
          />
          <path
            d="M32.83 74.423a33.2 33.2 0 0 0 17.367 4.887v-3.172c-3.307 0-6.567-.545-9.66-1.59l1.805-6.867-2.267-.715-2.388 6.454a30 30 0 0 1-3.2-1.7 20.8 20.8 0 0 0-15.785-2.508 21 21 0 0 0 1.667-3.456 20.4 20.4 0 0 0 .652-12.247 30 30 0 0 1-.66-3.405l7.203-1.437-.357-2.352-7.106.742q-.019-.527-.02-1.053l-.004-.115c-.006-.075-.499-7.517 2.85-11.677l-2.47-1.99c-4 4.97-3.602 12.983-3.546 13.837.004 2.79.355 5.56 1.04 8.239 1.784 6.963-.99 14.422-6.901 18.56l-7.871 5.51 1.817 2.6 8.628-6.04c5.68-3.975 13.22-4.171 19.21-.501z"
            fill="url(#c)"
          />
        </g>
        <defs>
          <linearGradient
            id="b"
            x1="0"
            y1="46"
            x2="101"
            y2="46"
            gradientUnits="userSpaceOnUse"
          >
            <stop stop-color="#a0dbe8" />
            <stop offset="1" stop-color="#1c75bc" />
          </linearGradient>
          <linearGradient
            id="c"
            x1="3.175"
            y1="56.59"
            x2="50.199"
            y2="56.59"
            gradientUnits="userSpaceOnUse"
          >
            <stop stop-color="#a0dbe8" />
            <stop offset="1" stop-color="#1c75bc" />
          </linearGradient>
          <clipPath id="a"><path fill="#fff" d="M0 0h101v92H0z" /></clipPath>
        </defs>
      </svg>
      <div
        class="text-[#3A5FB2] text-base lg:text-2xl font-medium tracking-widest leading-[1.6]"
      >
        <p>
          當白內障讓您的世界變得模糊、色彩不再鮮明時，接受手術無疑是重見清楚視力的最佳選擇。而現今白內障手術除了移除混濁的晶體，更有不同人工晶體選擇滿足患者不同需求，包括:
          單焦點人工晶體、單焦點EDOF人工晶體、多焦點人工晶體、散光人工晶體。
        </p>
      </div>
    </section>
  </div>
</template>
<style lang="scss" scoped>
.wrapper {
  padding-left: 12px;
  padding-right: 12px;
  margin-left: auto;
  margin-right: auto;
  max-width: 80rem;
}
.banner {
  background-image: url('https://statichk.cmermedical.com/hkcmereye/cataract/depth/depth-banner-m-v1.webp');
  background-size: cover;
  background-repeat: no-repeat;
}
@media screen and (max-width: 1023px) {
  .banner {
    aspect-ratio: 103 / 59;
  }
}
@media screen and (min-width: 1024px) {
  .banner {
    height: 316px;
    background-image: url('https://statichk.cmermedical.com/hkcmereye/cataract/depth/depth-banner-pc-v1.webp');
  }
}
@media screen and (min-width: 1536px) {
  .wrapper {
    padding-left: 0;
    padding-right: 0;
  }
}
</style>
